//------------------------------------------------------------------------------

#include "roman_int.hpp"

//------------------------------------------------------------------------------

void work()
try {
    cout << "Введите римское число\n"
            "(Для завершения ввода используйте |):\n";

    Roman_int r;
    while (cin >> r) {
        // cin >> r;
        cout << r << '-' << r.as_int() << '\n';
    }
}
catch(exception& e) {
    cout << "ошибка: " << e.what() << '\n';
}
catch(...) {
    cout << "неизвестная ошибка!\n";
}

//------------------------------------------------------------------------------

int main()
{
    work();
    keep_window_open("~~");
    return 0;
}

//------------------------------------------------------------------------------
