//------------------------------------------------------------------------------

#include "my.h"

//------------------------------------------------------------------------------

int main()
{
    X::var = 7;
    X::print();     // Вывод var из пространства имен X
    using namespace Y;
    var = 9;
    print();        // Вывод var из пространства имен Y
    {
        using Z::var;
        using Z::print;
        var = 11;
        print();    // Вывод var из пространства имен Z
    }
    print();        // Вывод var из пространства имен Y
    X::print();     // Вывод var из пространства имен X

    keep_window_open("~~");
    return 0;
}

//------------------------------------------------------------------------------

